# Pandas

In [2]:
import numpy as np
import pandas as pd

## Series

In [3]:
myDictionary = {"Furkan":20,"Atil":40,"Ahmet":23}

In [4]:
pd.Series(myDictionary)

Furkan    20
Atil      40
Ahmet     23
dtype: int64

In [5]:
ages = [10,20,30]
names =["Furkan","Ahmet","Bulut"]

In [6]:
pd.Series(ages)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(ages,names)

Furkan    10
Ahmet     20
Bulut     30
dtype: int64

In [8]:
pd.Series(names,ages)

10    Furkan
20     Ahmet
30     Bulut
dtype: object

In [10]:
pd.Series(data=ages,index=names)

Furkan    10
Ahmet     20
Bulut     30
dtype: int64

In [16]:
numpyArray = np.array([50,40,30])

In [17]:
numpyArray

array([50, 40, 30])

In [18]:
pd.Series(numpyArray)

0    50
1    40
2    30
dtype: int32

In [19]:
pd.Series(numpyArray,names)

Furkan    50
Ahmet     40
Bulut     30
dtype: int32

In [21]:
pd.Series(["Furkan","Ahmet","Bulut"],[1,2,3])

1    Furkan
2     Ahmet
3     Bulut
dtype: object

In [28]:
raceResult1 = pd.Series([10,5,1],["Furkan","Ahmet","Bulut"])

In [29]:
raceResult1

Furkan    10
Ahmet      5
Bulut      1
dtype: int64

In [30]:
raceResult2 = pd.Series([20,10,8],["Furkan","Ahmet","Bulut"])

In [31]:
raceResult2

Furkan    20
Ahmet     10
Bulut      8
dtype: int64

In [32]:
result = raceResult1 + raceResult2

In [33]:
result

Furkan    30
Ahmet     15
Bulut      9
dtype: int64

In [34]:
differentSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [38]:
differentSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [39]:
differentSeries

a    20
b    30
c    40
d    50
dtype: int64

In [40]:
differentSeries2

a    10
c     5
f     3
g     1
dtype: int64

In [41]:
differentSeries + differentSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## DataFrame

In [46]:
data = np.random.randn(4,3)

In [47]:
data

array([[ 0.07687228,  1.3401347 , -0.90940769],
       [ 0.01128908, -0.77068601,  1.47718109],
       [ 2.31067157,  0.6610011 ,  1.08350702],
       [ 1.76141166, -0.60369206,  0.12894714]])

In [48]:
dataFrame = pd.DataFrame(data)

In [49]:
dataFrame

          0         1         2
0  0.076872  1.340135 -0.909408
1  0.011289 -0.770686  1.477181
2  2.310672  0.661001  1.083507
3  1.761412 -0.603692  0.128947

In [51]:
dataFrame[0]

0    0.076872
1    0.011289
2    2.310672
3    1.761412
Name: 0, dtype: float64

In [52]:
type(dataFrame[0])

pandas.core.series.Series

In [55]:
newDataFrame = pd.DataFrame(data,index=["Furkan","Ahmet","Adem","Hatice"],columns =["Maas","Yas","Calisma Saati"])

In [56]:
newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [60]:
newDataFrame["Yas"]

Furkan    1.340135
Ahmet    -0.770686
Adem      0.661001
Hatice   -0.603692
Name: Yas, dtype: float64

In [65]:
newDataFrame[["Yas","Maas"]]

             Yas      Maas
Furkan  1.340135  0.076872
Ahmet  -0.770686  0.011289
Adem    0.661001  2.310672
Hatice -0.603692  1.761412

In [66]:
newDataFrame.loc["Furkan"]

Maas             0.076872
Yas              1.340135
Calisma Saati   -0.909408
Name: Furkan, dtype: float64

In [68]:
newDataFrame.loc[["Furkan","Ahmet"]]

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181

In [69]:
newDataFrame.iloc[0]

Maas             0.076872
Yas              1.340135
Calisma Saati   -0.909408
Name: Furkan, dtype: float64

### DataFrame Ä°ndex

In [78]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] + newDataFrame["Yas"]

In [79]:
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.076872  1.340135      -0.909408        2.680269
Ahmet   0.011289 -0.770686       1.477181       -1.541372
Adem    2.310672  0.661001       1.083507        1.322002
Hatice  1.761412 -0.603692       0.128947       -1.207384

In [83]:
newDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [84]:
newDataFrame.drop("Hatice",axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.076872  1.340135      -0.909408        2.680269
Ahmet   0.011289 -0.770686       1.477181       -1.541372
Adem    2.310672  0.661001       1.083507        1.322002

In [85]:
newDataFrame.drop("Hatice")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.076872  1.340135      -0.909408        2.680269
Ahmet   0.011289 -0.770686       1.477181       -1.541372
Adem    2.310672  0.661001       1.083507        1.322002

In [86]:
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Furkan  0.076872  1.340135      -0.909408        2.680269
Ahmet   0.011289 -0.770686       1.477181       -1.541372
Adem    2.310672  0.661001       1.083507        1.322002
Hatice  1.761412 -0.603692       0.128947       -1.207384

In [87]:
newDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [88]:
newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [90]:
newDataFrame.loc["Furkan"]["Maas"]

0.07687228471302164

In [91]:
newDataFrame.loc["Furkan","Maas"]

0.07687228471302164

In [92]:
newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [93]:
newDataFrame <0

         Maas    Yas  Calisma Saati
Furkan  False  False           True
Ahmet   False   True          False
Adem    False  False          False
Hatice  False   True          False

In [94]:
booleanFrame = newDataFrame < 0

In [95]:
booleanFrame

         Maas    Yas  Calisma Saati
Furkan  False  False           True
Ahmet   False   True          False
Adem    False  False          False
Hatice  False   True          False

In [96]:
newDataFrame

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [97]:
newDataFrame[booleanFrame]

        Maas       Yas  Calisma Saati
Furkan   NaN       NaN      -0.909408
Ahmet    NaN -0.770686            NaN
Adem     NaN       NaN            NaN
Hatice   NaN -0.603692            NaN

In [98]:
newDataFrame[newDataFrame<0]

        Maas       Yas  Calisma Saati
Furkan   NaN       NaN      -0.909408
Ahmet    NaN -0.770686            NaN
Adem     NaN       NaN            NaN
Hatice   NaN -0.603692            NaN

In [99]:
newDataFrame[newDataFrame["Yas"]>0]

            Maas       Yas  Calisma Saati
Furkan  0.076872  1.340135      -0.909408
Adem    2.310672  0.661001       1.083507

In [101]:
newDataFrame[newDataFrame["Calisma Saati"]>0]

            Maas       Yas  Calisma Saati
Ahmet   0.011289 -0.770686       1.477181
Adem    2.310672  0.661001       1.083507
Hatice  1.761412 -0.603692       0.128947

In [104]:
newDataFrame[(newDataFrame["Calisma Saati"] > 0) & (newDataFrame["Yas"] > 0)]

          Maas       Yas  Calisma Saati
Adem  2.310672  0.661001       1.083507

## index changing

In [108]:
newDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0  Furkan  0.076872  1.340135      -0.909408
1   Ahmet  0.011289 -0.770686       1.477181
2    Adem  2.310672  0.661001       1.083507
3  Hatice  1.761412 -0.603692       0.128947

In [109]:
newIndexList = ["Fur","Ahm","Ade","Hat"]

In [111]:
newDataFrame["New Index"] = newIndexList

In [112]:
newDataFrame

            Maas       Yas  Calisma Saati New Index
Furkan  0.076872  1.340135      -0.909408       Fur
Ahmet   0.011289 -0.770686       1.477181       Ahm
Adem    2.310672  0.661001       1.083507       Ade
Hatice  1.761412 -0.603692       0.128947       Hat

In [113]:
newDataFrame.set_index("New Index")

               Maas       Yas  Calisma Saati
New Index
Fur        0.076872  1.340135      -0.909408
Ahm        0.011289 -0.770686       1.477181
Ade        2.310672  0.661001       1.083507
Hat        1.761412 -0.603692       0.128947

newDataFrame

In [116]:
newDataFrame.set_index("New Index",inplace=True)

In [117]:
newDataFrame

               Maas       Yas  Calisma Saati
New Index
Fur        0.076872  1.340135      -0.909408
Ahm        0.011289 -0.770686       1.477181
Ade        2.310672  0.661001       1.083507
Hat        1.761412 -0.603692       0.128947

In [120]:
newDataFrame.loc["Fur"]

Maas             0.076872
Yas              1.340135
Calisma Saati   -0.909408
Name: Fur, dtype: float64

### Multi index

In [133]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [134]:
innerIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [135]:
indexConcat = list(zip(firstIndex,innerIndex))

In [136]:
indexConcat

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [137]:
indexConcat = pd.MultiIndex.from_tuples(indexConcat)

In [138]:
indexConcat

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [139]:
type(indexConcat)

pandas.core.indexes.multi.MultiIndex

In [140]:
movieList = [[40,"A"],[30,"B"],[10,"C"],[50,"D"],[10,"E"],[11,"F"]]

In [141]:
movieListNumpy = np.array(movieList)

In [142]:
movieDataFrame = pd.DataFrame(movieListNumpy,index=indexConcat,columns=["Yas","Meslek"])

In [143]:
movieDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    10      C
South Park Cartman  50      D
           Kenny    10      E
           Kyle     11      F

In [144]:
movieDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Marge  10      C

In [146]:
movieDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [149]:
movieDataFrame.index.names = ["Aile","Ä°sim"]

In [150]:
movieDataFrame

                   Yas Meslek
Aile       Ä°sim
Simpson    Homer    40      A
           Bart     30      B
           Marge    10      C
South Park Cartman  50      D
           Kenny    10      E
           Kyle     11      F

# Operations

In [152]:
data = { "Istanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}

In [153]:
weatherDataFrame = pd.DataFrame(data)

In [154]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [155]:
indexDay = ["Pazartesi","SalÄ±","Carsamba"]

In [164]:
weatherDataFrame["GÃ¼nler"]=indexDay

In [165]:
weatherDataFrame

           Istanbul  Ankara  Izmir     GÃ¼nler
GÃ¼nler
Pazartesi      30.0    20.0     40  Pazartesi
SalÄ±           29.0     NaN     39       SalÄ±
Carsamba        NaN    25.0     38   Carsamba

In [166]:
weatherDataFrame.set_index("GÃ¼nler",inplace=True)

In [167]:
weatherDataFrame

           Istanbul  Ankara  Izmir
GÃ¼nler
Pazartesi      30.0    20.0     40
SalÄ±           29.0     NaN     39
Carsamba        NaN    25.0     38

In [168]:
weatherDataFrame.dropna()

           Istanbul  Ankara  Izmir
GÃ¼nler
Pazartesi      30.0    20.0     40

In [169]:
weatherDataFrame.dropna(axis=1)

           Izmir
GÃ¼nler
Pazartesi     40
SalÄ±          39
Carsamba      38

In [176]:
newdata = { "Istanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
newWeatherDataFrame = pd.DataFrame(newdata)
newWeatherDataFrame["GÃ¼nler"]  = indexDay
newWeatherDataFrame.set_index("GÃ¼nler",inplace=True)

In [177]:
newWeatherDataFrame

           Istanbul  Ankara  Izmir  Antalya
GÃ¼nler
Pazartesi      30.0    20.0     40     45.0
SalÄ±           29.0     NaN     39      NaN
Carsamba        NaN    25.0     38      NaN

In [178]:
newWeatherDataFrame.dropna(axis=1,thresh=2)

           Istanbul  Ankara  Izmir
GÃ¼nler
Pazartesi      30.0    20.0     40
SalÄ±           29.0     NaN     39
Carsamba        NaN    25.0     38

In [189]:
newWeatherDataFrame.dropna(axis=1,thresh=2)

           Istanbul  Ankara  Izmir
GÃ¼nler
Pazartesi      30.0    20.0     40
SalÄ±           29.0     NaN     39
Carsamba        NaN    25.0     38

In [192]:
newWeatherDataFrame.dropna(axis=0,thresh=3)

           Istanbul  Ankara  Izmir  Antalya
GÃ¼nler
Pazartesi      30.0    20.0     40     45.0

In [193]:
newWeatherDataFrame.fillna(20)

           Istanbul  Ankara  Izmir  Antalya
GÃ¼nler
Pazartesi      30.0    20.0     40     45.0
SalÄ±           29.0    20.0     39     20.0
Carsamba       20.0    25.0     38     20.0

# groupby

In [261]:
salary= {"Department": ["YazÄ±lÄ±m","YazÄ±lÄ±m","Pazarlama","Pazarlama","Hukuk","Hukuk"],
         "Workers Name": ["Furkan","Ahmet","Adem","Hatice","Bulut","Caner"],
         "Salary" : ["100","150","120","200","300","150"] }

In [262]:
salaryDataFrame= pd.DataFrame(salary)

In [263]:
salaryDataFrame

  Department Workers Name Salary
0    YazÄ±lÄ±m       Furkan    100
1    YazÄ±lÄ±m        Ahmet    150
2  Pazarlama         Adem    120
3  Pazarlama       Hatice    200
4      Hukuk        Bulut    300
5      Hukuk        Caner    150

In [264]:
group = salaryDataFrame.groupby("Department")

In [265]:
group.count()

            Workers Name  Salary
Department
Hukuk                  2       2
Pazarlama              2       2
YazÄ±lÄ±m                2       2

In [266]:
group.mean()

C:\Users\furka\AppData\Local\Temp\ipykernel_5612\3928442431.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.mean()

              Salary
Department
Hukuk       150075.0
Pazarlama    60100.0
YazÄ±lÄ±m      50075.0

In [267]:
group.max()

           Workers Name Salary
Department
Hukuk             Caner    300
Pazarlama        Hatice    200
YazÄ±lÄ±m          Furkan    150

In [268]:
group.min()

           Workers Name Salary
Department
Hukuk             Bulut    150
Pazarlama          Adem    120
YazÄ±lÄ±m           Ahmet    100

In [269]:
group.describe()

           Workers Name                     Salary
                  count unique     top freq  count unique  top freq
Department
Hukuk                 2      2   Bulut    1      2      2  300    1
Pazarlama             2      2    Adem    1      2      2  120    1
YazÄ±lÄ±m               2      2  Furkan    1      2      2  100    1

# Concat

In [305]:
data = {"name":["Ahmet","Furkan","Adem","Hatice"],
       "Spor" : ["KoÅu","YÃ¼zme","KoÅu","Basketball"],
       "Kalori":[100,200,300,400]}
dataFrame1= pd.DataFrame(data,index=[0,1,2,3])

In [306]:
dataFrame1

     name        Spor  Kalori
0   Ahmet        KoÅu     100
1  Furkan       YÃ¼zme     200
2    Adem        KoÅu     300
3  Hatice  Basketball     400

In [307]:
data2 = {"name":["Caner","Burak","Can","Okan"],
       "Spor" : ["KoÅu","YÃ¼zme","Tenis","Basketball"],
       "Kalori":[300,525,125,300]}
dataFrame2= pd.DataFrame(data2,index=[4,5,6,7])

In [308]:
dataFrame2

    name        Spor  Kalori
4  Caner        KoÅu     300
5  Burak       YÃ¼zme     525
6    Can       Tenis     125
7   Okan  Basketball     300

In [309]:
data3 = {"name": ["Ethem","Onur","Karamurat","Enes"],
       "Spor" : ["KoÅu","YÃ¼zme","KoÅu","Basketball"],
       "Kalori":[400
                 ,455,200,175] }
dataFrame3=pd.DataFrame(data3,index=[8,9,10,11])

In [310]:
dataFrame3

         name        Spor  Kalori
8       Ethem        KoÅu     400
9        Onur       YÃ¼zme     455
10  Karamurat        KoÅu     200
11       Enes  Basketball     175

#### concatenation

In [318]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

         name        Spor  Kalori
0       Ahmet        KoÅu     100
1      Furkan       YÃ¼zme     200
2        Adem        KoÅu     300
3      Hatice  Basketball     400
4       Caner        KoÅu     300
5       Burak       YÃ¼zme     525
6         Can       Tenis     125
7        Okan  Basketball     300
8       Ethem        KoÅu     400
9        Onur       YÃ¼zme     455
10  Karamurat        KoÅu     200
11       Enes  Basketball     175

In [321]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1)

,name,Spor,Kalori,name,Spor,Kalori,name,Spor,Kalori
0,Ahmet,KoÅu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Furkan,YÃ¼zme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Adem,KoÅu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Hatice,Basketball,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Caner,KoÅu,300.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Burak,YÃ¼zme,525.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Can,Tenis,125.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Okan,Basketball,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ethem,KoÅu,400.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Onur,YÃ¼zme,455.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Karamurat,KoÅu,200.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Enes,Basketball,175.0

# merge

In [322]:
data= { "Name":["Furkan","Ahmet","Bulut","Hatice"],
      "Spor":["KoÅu","YÃ¼zme","KoÅu","Basketball"]}

mergeDataFrame1= pd.DataFrame(data)

In [323]:
mergeDataFrame1

     Name        Spor
0  Furkan        KoÅu
1   Ahmet       YÃ¼zme
2   Bulut        KoÅu
3  Hatice  Basketball

In [324]:
data2= { "Name":["Furkan","Ahmet","Bulut","Hatice"],
      "Kalori":[100,200,300,400]}

mergeDataFrame2= pd.DataFrame(data2)

In [325]:
mergeDataFrame2

     Name  Kalori
0  Furkan     100
1   Ahmet     200
2   Bulut     300
3  Hatice     400

In [326]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Name")

     Name        Spor  Kalori
0  Furkan        KoÅu     100
1   Ahmet       YÃ¼zme     200
2   Bulut        KoÅu     300
3  Hatice  Basketball     400

# different operations (tips and trips)

In [327]:
salaryData = {"Name":["Furkan","Ahmet","Adem","Bulut"],
             "Department":["YazÄ±lÄ±m","SatÄ±s","Pazarlama","YazÄ±lÄ±m"],
             "Salary": [np.random.randint(0,1000),np.random.randint(0,1000),np.random.randint(0,1000),np.random.randint(0,1000)]}
salaryDataFrame = pd.DataFrame(salaryData,index=[1,2,3,4])
salaryDataFrame

     Name Department  Salary
1  Furkan    YazÄ±lÄ±m     542
2   Ahmet      SatÄ±s     882
3    Adem  Pazarlama     813
4   Bulut    YazÄ±lÄ±m     125

In [331]:
salaryDataFrame["Department"].unique()

array(['YazÄ±lÄ±m', 'SatÄ±s', 'Pazarlama'], dtype=object)

In [332]:
salaryDataFrame["Department"].nunique()

3

In [334]:
salaryDataFrame["Department"].value_counts()

YazÄ±lÄ±m      2
SatÄ±s        1
Pazarlama    1
Name: Department, dtype: int64

In [347]:
def netSalary(salary):
    return salary*0.66

In [348]:
salaryDataFrame["Salary"].apply(netSalary)

1    357.72
2    582.12
3    536.58
4     82.50
Name: Salary, dtype: float64

In [349]:
salaryDataFrame.isnull()

    Name  Department  Salary
1  False       False   False
2  False       False   False
3  False       False   False
4  False       False   False

In [356]:
data = { "Class":["South Park","South Park","Simpson","Simpson","Simpson"],
       "Names":["Cartman","Kenny","Homer","Bart","Bart"],
        "Ages":[np.random.randint(0,50),np.random.randint(0,50),
               np.random.randint(0,50),np.random.randint(0,50),
               np.random.randint(0,50)]}
chDataFrame= pd.DataFrame(data)
chDataFrame

        Class    Names  Ages
0  South Park  Cartman    40
1  South Park    Kenny     2
2     Simpson    Homer    12
3     Simpson     Bart    20
4     Simpson     Bart    24

In [358]:
chDataFrame.pivot_table(values="Ages",index=["Class","Names"],aggfunc=np.sum)

                    Ages
Class      Names
Simpson    Bart       44
           Homer      12
South Park Cartman    40
           Kenny       2

In [359]:
chDataFrame.pivot_table(values="Ages",index=["Class","Names"])

                    Ages
Class      Names
Simpson    Bart       22
           Homer      12
South Park Cartman    40
           Kenny       2

# Working with Excell

In [413]:
dataFrame = pd.read_csv("testData.xlsx")

In [399]:
dataFrame

Empty DataFrame
Columns: [<table style="border-collapse: collapse; width: 100%;"><tr style="background-color: #f2f2f2; font-weight: bold;"><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#214;&#287;renci No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">T.C. Kimlik No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Ad</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Soyad</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">B&#246;l&#252;m</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">E&#287;itim T&#252;r&#252;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Program</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Akademik Y&#305;l</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">D&#246;nem</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Vergi No/T.C. Kimlik No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Unvan&#305;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme &#199;al&#305;&#351;an Say&#305;s&#305;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Adresi</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme IBAN No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Ay</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Puantaj</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#214;denen &#220;cret</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Dekont Zaman&#305;nda Geldi</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Sisteme Girilme Tarihi</th></tr><tr><td style="padding: 8px; border: 1px solid #ddd; white-space: nowrap;">No matching records found</td></tr></table>]
Index: []

In [420]:
dataFrame.fillna(0)
dataFrame

Empty DataFrame
Columns: [<table style="border-collapse: collapse; width: 100%;"><tr style="background-color: #f2f2f2; font-weight: bold;"><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#214;&#287;renci No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">T.C. Kimlik No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Ad</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Soyad</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">B&#246;l&#252;m</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">E&#287;itim T&#252;r&#252;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Program</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Akademik Y&#305;l</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">D&#246;nem</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Vergi No/T.C. Kimlik No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Unvan&#305;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme &#199;al&#305;&#351;an Say&#305;s&#305;</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme Adresi</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#304;&#351;letme IBAN No</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Ay</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Puantaj</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">&#214;denen &#220;cret</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Dekont Zaman&#305;nda Geldi</th><th style="padding: 8px; border: 1px solid #ddd; background-color: #e9e9e9; white-space: nowrap;">Sisteme Girilme Tarihi</th></tr><tr><td style="padding: 8px; border: 1px solid #ddd; white-space: nowrap;">No matching records found</td></tr></table>]
Index: []

In [421]:
dataFrame.to_csv("newData.xlsx")